#include "1602.h"
#include "string.h"
/******************************************************************/
/*                    函数声明                                    */
/******************************************************************/
/******************************************************************/
/*                    微秒延时函数                                */
/******************************************************************/
void DelayUs(unsigned char us)//delay us
{
	unsigned char uscnt;
	uscnt=us>>1;        /*12MHz频率*/
	while(--uscnt);
}
/******************************************************************/
/*                    毫秒函数声明                                */
/******************************************************************/
void DelayMs(unsigned char ms)
{
	while(--ms)
	{
		DelayUs(250);
		DelayUs(250);
		DelayUs(250);
		DelayUs(250);
	}
}
/******************************************************************/
/*                   写入命令函数                                 */
/******************************************************************/
void WriteCommand(unsigned char c)
{
	DelayMs(5);//操作前短暂延时，保证信号稳定
	E=0;
	RS=0;
	RW=0;
	_nop_();
	E=1;
	Data=c;
	E=0;
}
/******************************************************************/
/*                   写入数据函数                                 */
/******************************************************************/
void WriteData(unsigned char c)
{
	DelayMs(5);  //操作前短暂延时，保证信号稳定
	E=0;
	RS=1;
	RW=0;
	_nop_();
	E=1;
	Data=c;
	E=0;
	RS=0;
}
/******************************************************************/
/*                   写入字节函数                                 */
/******************************************************************/
void ShowChar(unsigned char pos,unsigned char c)
{
	unsigned char p;
	if(pos>=0x10)
		p=pos+0xb0; //是第二行则命令代码高4位为0xc
	else 
		p=pos+0x80; //是第一行则命令代码高4位为0x8
	WriteCommand(p);//写命令
	WriteData(c);   //写数据
}
/******************************************************************/
/*                   写入字符串函数                               */
/******************************************************************/
void ShowString(unsigned char line,char *ptr)
{
	unsigned char l,i;
	l=line<<4;
	for(i=0;i<strlen(ptr);i++)
	{
		ShowChar(l++,*(ptr+i));//循环显示16个字符
	}
}
/******************************************************************/
/*                   初始化函数                                   */
/******************************************************************/
void InitLcd(void)
{
	DelayMs(15);
	WriteCommand(0x38); //display mode
	WriteCommand(0x38); //display mode
	WriteCommand(0x38); //display mode
	WriteCommand(0x06); //显示光标移动位置
	WriteCommand(0x0c); //显示开及光标设置
	WriteCommand(0x01); //显示清屏
} 
